pmo-dataset/graphviz/34.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "New order received" -> "ExclusiveGateway_3";
  "Order Lego brick\nsets" -> "Give the lego sets\nto the children";
  "Give the lego sets\nto the children" -> "Sort the parts into\ncontainers";
  "Parts remained?" -> "ExclusiveGateway_1" [label="Yes"];
  "ExclusiveGateway_1" -> "Container empty?";
  "ExclusiveGateway_2" -> "Build the next\nsubcomponent";
  "Build the next\nsubcomponent" -> "Parts remained?";
  "Container empty?" -> "Reorder parts" [label="Yes"];
  "Reorder parts" -> "ExclusiveGateway_2";
  "Container empty?" -> "ExclusiveGateway_2" [label="No"];
  "ParallelGateway_1" -> "Test subcomponent 1";
  "ParallelGateway_1" -> "Test subcomponent 4";
  "Test subcomponent 4" -> "ParallelGateway_2";
  "Test subcomponent 3" -> "ParallelGateway_2";
  "Test subcomponent 1" -> "ParallelGateway_2";
  "ParallelGateway_2" -> "All tests\nsuccessfull?";
  "Assemble\nsubcomponents" -> "Machine assembled";
  "Test subcomponent 2" -> "ParallelGateway_2";
  "ExclusiveGateway_3" -> "Develop basic design";
  "All tests\nsuccessfull?" -> "ExclusiveGateway_3" [label="No"];
  "All tests\nsuccessfull?" -> "Assemble\nsubcomponents" [label="Yes"];
  "Parts remained?" -> "ParallelGateway_1" [label="No"];
  "Develop basic design" -> "Brick sets already\nordered?";
  "Brick sets already\nordered?" -> "Order Lego brick\nsets" [label="No"];
  "Sort the parts into\ncontainers" -> "ExclusiveGateway_4";
  "ExclusiveGateway_4" -> "ExclusiveGateway_1";
  "Brick sets already\nordered?" -> "ExclusiveGateway_4" [label="Yes"];
  "ParallelGateway_1" -> "Test subcomponent 2";
  "ParallelGateway_1" -> "Test subcomponent 3";

  "New order received" [shape=circle];
  "Machine assembled" [shape=circle, penwidth=4];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "Parts remained?" [shape=diamond];
  "Container empty?" [shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "All tests\nsuccessfull?" [shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "Brick sets already\nordered?" [shape=diamond];
  "ExclusiveGateway_4" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
}
