pmo-dataset/variations/mermaid_with_ids/34.mmd
graph LR
	classDef endEvent stroke-width:3px
	User_1["Develop basic design"]
	User_2["Order Lego brick\nsets"]
	Service_1["Test subcomponent 1"]
	Service_2["Test subcomponent 2"]
	Service_3["Test subcomponent 3"]
	Service_4["Test subcomponent 4"]
	Manual_1["Give the lego sets\nto the children"]
	Manual_2["Sort the parts into\ncontainers"]
	Manual_3["Build the next\nsubcomponent"]
	Manual_4["Reorder parts"]
	Manual_5["Assemble\nsubcomponents"]
	StartNoneEvent_1(("New order received"))
	EndNoneEvent_1(("Machine assembled")):::endEvent
	ExclusiveGateway_1{"X"}
	ExclusiveGateway_2{"Parts remained?"}
	ExclusiveGateway_3{"Container empty?"}
	ExclusiveGateway_4{"X"}
	ExclusiveGateway_5{"All tests\nsuccessfull?"}
	ExclusiveGateway_6{"X"}
	ExclusiveGateway_7{"Brick sets already\nordered?"}
	ExclusiveGateway_8{"X"}
	ParallelGateway_1{"+"}
	ParallelGateway_2{"+"}

	StartNoneEvent_1 --> ExclusiveGateway_6
	User_2 --> Manual_1
	Manual_1 --> Manual_2
	ExclusiveGateway_2 -->|"Yes"| ExclusiveGateway_1
	ExclusiveGateway_1 --> ExclusiveGateway_3
	ExclusiveGateway_4 --> Manual_3
	Manual_3 --> ExclusiveGateway_2
	ExclusiveGateway_3 -->|"Yes"| Manual_4
	Manual_4 --> ExclusiveGateway_4
	ExclusiveGateway_3 -->|"No"| ExclusiveGateway_4
	ParallelGateway_1 --> Service_1
	ParallelGateway_1 --> Service_4
	Service_4 --> ParallelGateway_2
	Service_3 --> ParallelGateway_2
	Service_1 --> ParallelGateway_2
	ParallelGateway_2 --> ExclusiveGateway_5
	Manual_5 --> EndNoneEvent_1
	Service_2 --> ParallelGateway_2
	ExclusiveGateway_6 --> User_1
	ExclusiveGateway_5 -->|"No"| ExclusiveGateway_6
	ExclusiveGateway_5 -->|"Yes"| Manual_5
	ExclusiveGateway_2 -->|"No"| ParallelGateway_1
	User_1 --> ExclusiveGateway_7
	ExclusiveGateway_7 -->|"No"| User_2
	Manual_2 --> ExclusiveGateway_8
	ExclusiveGateway_8 --> ExclusiveGateway_1
	ExclusiveGateway_7 -->|"Yes"| ExclusiveGateway_8
	ParallelGateway_1 --> Service_2
	ParallelGateway_1 --> Service_3
